tutorials/conducting-walls-with-cht-flipped/fluid-openfoam/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 500;

boundaryField
{
    inlet
    {
        type            fixedValue;
	value		uniform 500;
    }
    outlet
    {
	type		zeroGradient;
    }
    top
    {
        type            fixedValue;
	value		uniform 400;
    }
    bottom
    {
        type            fixedValue;
	value		uniform 400;
    }
    right
    {
        type            fixedValue;
	value		uniform 400;
    }
    left
    {
	type		fixedValue;
	value		uniform 400;
    }
}

